# DataFrame

https://pandas.pydata.org/docs/reference/frame.html

## DataFrame 생성

In [2]:
import pandas as pd
import numpy as np

In [1]:
# dict-list 생성하기
data = {
    'one' : [1, 2, 3, 4, 5],
    'two' : ['가', '나', '다', '라', '마'],
    'three' : [1.23, 2.34, 3.45, 4.56, 5.67],
    'four' : True
}
df = pd.DataFrame(data)
df

NameError: name 'pd' is not defined

In [6]:
df['one']
print(type(df['one']))

<class 'pandas.core.series.Series'>

In [7]:
#list-dict 생성하기
data = [
    {'a': 1, 'b': 2},
    {'a': 3, 'b': 4, 'c': 5},
    {'a': 6, 'b': 7, 'c': 8}
]
df = pd.DataFrame(data)
df

df.index = ['홍길동', '신사임당', '이순신']
print(df.index)

print(df.columns)
df.columns = ['협동심', '성실도', '인내심']
print(df.columns)

df

Index(['홍길동', '신사임당', '이순신'], dtype='object')
Index(['a', 'b', 'c'], dtype='object')
Index(['협동심', '성실도', '인내심'], dtype='object')

      협동심  성실도  인내심
홍길동     1    2  NaN
신사임당    3    4  5.0
이순신     6    7  8.0

In [8]:
# 2차원 ndarray 생성
arr = np.random.randn(2, 3)
num_df = pd.DataFrame(arr)
# num_df
# print(type(num_df))

# num_df.index = ['가', '나']
# num_df.columns = ['A', 'B', 'C']

num_df = pd.DataFrame(arr, index=['가', '나'], columns=['A', 'B', 'C'])

num_df

          A         B         C
가  1.241108  0.847546  0.581280
나  0.399920 -0.604142 -1.198872

In [9]:
# 나와 내 친구 정보를 df객체로 생성
# - 이름, 나이, 성별
data = {
    '이름' : ['홍길동', '신사임당'],
    '나이' : [ 33, 48],
    '성별' : ['M', 'F']
}
df = pd.DataFrame(data)
df

     이름  나이 성별
0   홍길동  33  M
1  신사임당  48  F

In [10]:
df.T

      0     1
이름  홍길동  신사임당
나이   33    48
성별    M     F

In [11]:
data = {
    '홍길동' : ['홍길동', 33, 'M'],
    '신사임당' : ['신사임당', 48, 'F']
}
df = pd.DataFrame(data, index=['이름', '나이', '성별'])
df

    홍길동  신사임당
이름  홍길동  신사임당
나이   33    48
성별    M     F

## DataFrame 속성

In [12]:
df.index

Index(['이름', '나이', '성별'], dtype='object')

In [13]:
df.columns

Index(['홍길동', '신사임당'], dtype='object')

In [14]:
df.values
print(type(df.values))
print(df.values)

<class 'numpy.ndarray'>
[['홍길동' '신사임당']
 [33 48]
 ['M' 'F']]

In [15]:
df.shape

(3, 2)

In [16]:
df.size

6

In [17]:
df.ndim

2

In [18]:
df.dtypes

홍길동     object
신사임당    object
dtype: object

In [19]:
df.T

        이름  나이 성별
홍길동    홍길동  33  M
신사임당  신사임당  48  F

## DataFrame 메소드

In [20]:
bank_client_df = pd.DataFrame({
    'Bank client ID':[1, 2, 3, 4],
    'Bank Client Name':['Laila Aly', 'Kate Steve', 'Nicole Mitch', 'Francis Morris'],
    'Net worth [$]':[35000, 3000, 100000, 2000],
    'Years with bank':[4, 7, 10, 15]})
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7
2               3     Nicole Mitch         100000               10
3               4   Francis Morris           2000               15

In [21]:
bank_client_df.head(2)

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7

In [22]:
bank_client_df.tail(2)

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
2               3     Nicole Mitch         100000               10
3               4   Francis Morris           2000               15

In [23]:
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Bank client ID    4 non-null      int64
 1   Bank Client Name  4 non-null      object
 2   Net worth [$]     4 non-null      int64
 3   Years with bank   4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [24]:
bank_client_df.describe()

       Bank client ID  Net worth [$]  Years with bank
count        4.000000       4.000000         4.000000
mean         2.500000   35000.000000         9.000000
std          1.290994   45963.753836         4.690416
min          1.000000    2000.000000         4.000000
25%          1.750000    2750.000000         6.250000
50%          2.500000   19000.000000         8.500000
75%          3.250000   51250.000000        11.250000
max          4.000000  100000.000000        15.000000

In [25]:
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7
2               3     Nicole Mitch         100000               10
3               4   Francis Morris           2000               15

## 조회
- iloc 인덱스(행/열) - 행/열 순서로 조회
- loc 라벨(행/열) - 행/열 순서로 조회
- 컬럼라벨

In [26]:
# indexing/slicing

# 행 데이터 하나를 조회시 Series 타입으로 변환
# bank_client_df[0]
bank_client_df.iloc[0]
print(type(bank_client_df.iloc[0])) # Series
print(bank_client_df.iloc[0].index) # df.cloumns
print(bank_client_df.iloc[0].name)
bank_client_df.iloc[0]

<class 'pandas.core.series.Series'>
Index(['Bank client ID', 'Bank Client Name', 'Net worth [$]',
       'Years with bank'],
      dtype='object')
0

Bank client ID              1
Bank Client Name    Laila Aly
Net worth [$]           35000
Years with bank             4
Name: 0, dtype: object

In [27]:
# slicing과 같이 조회결과가 2행(열)이상이면 DataFrame타입으로 반환된다.
bank_client_df.iloc[:2]
print(type(bank_client_df.iloc[:2])) # DataFrame
bank_client_df.iloc[:2]

<class 'pandas.core.frame.DataFrame'>

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7

In [28]:
bank_client_df.iloc[[0,1]]

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7

In [29]:
# fancy indexing을 통한 조회에서는 1행(열)이어도 DataFrame타입으로 반환
# - DataFrame타입으로 반환된다는 것은 차원을 유지하는 것이다.
# - Series타입으로 반환된 것은 차원을 제거한 것이다.
bank_client_df.iloc[[0]]
print(type(bank_client_df.iloc[[0]]))
print(bank_client_df.iloc[[0]].shape)
print(bank_client_df.iloc[0].shape)
bank_client_df.iloc[[0]]

<class 'pandas.core.frame.DataFrame'>
(1, 4)
(4,)

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4

In [30]:
# 2차원 indexing/slicing
bank_client_df.iloc[0, 1]

'Laila Aly'

In [31]:
bank_client_df.iloc[:2, 1]
# print(type(bank_client_df.iloc[:2, 1]))

0     Laila Aly
1    Kate Steve
Name: Bank Client Name, dtype: object

In [32]:
bank_client_df

   Bank client ID Bank Client Name  Net worth [$]  Years with bank
0               1        Laila Aly          35000                4
1               2       Kate Steve           3000                7
2               3     Nicole Mitch         100000               10
3               4   Francis Morris           2000               15

In [33]:
bank_client_df.iloc[:2, 2:]
print(type(bank_client_df.iloc[:2, 2:]))
bank_client_df.iloc[:2, 2:].shape

<class 'pandas.core.frame.DataFrame'>

(2, 2)

In [34]:
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']
bank_client_df

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client1               1        Laila Aly          35000                4
client2               2       Kate Steve           3000                7
client3               3     Nicole Mitch         100000               10
client4               4   Francis Morris           2000               15

In [35]:
# loc 인덱스라벨, 컬럼라벨로 조회
bank_client_df.loc['client3']

Bank client ID                 3
Bank Client Name    Nicole Mitch
Net worth [$]             100000
Years with bank               10
Name: client3, dtype: object

In [36]:
# label slicing start:end (end포함)
bank_client_df.loc['client2':]
bank_client_df.loc['client1':'client3':2]

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client1               1        Laila Aly          35000                4
client3               3     Nicole Mitch         100000               10

In [37]:
bank_client_df.loc['client2':'client4':2, 'Bank Client Name']

client2        Kate Steve
client4    Francis Morris
Name: Bank Client Name, dtype: object

In [38]:
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']
print(bank_client_df)

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client1               1        Laila Aly          35000                4
client2               2       Kate Steve           3000                7
client3               3     Nicole Mitch         100000               10
client4               4   Francis Morris           2000               15

In [39]:
bank_client_df.loc['client2':'client4':2, 'Bank Client Name':'Net worth [$]']

        Bank Client Name  Net worth [$]
client2       Kate Steve           3000
client4   Francis Morris           2000

In [40]:
bank_client_df.loc['client2':'client4':2, ['Bank Client Name', 'Net worth [$]']]

        Bank Client Name  Net worth [$]
client2       Kate Steve           3000
client4   Francis Morris           2000

In [41]:
# 이름 Kate Steve인 고객의 정보를 출력
bank_client_df.loc[bank_client_df['Bank Client Name'] == 'Kate Steve']

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client2               2       Kate Steve           3000                7

In [42]:
# 컬럼 라벨 조회
bank_client_df['Bank Client Name']

client1         Laila Aly
client2        Kate Steve
client3      Nicole Mitch
client4    Francis Morris
Name: Bank Client Name, dtype: object

In [43]:
bank_client_df[['Bank Client Name', 'Bank client ID']]

        Bank Client Name  Bank client ID
client1        Laila Aly               1
client2       Kate Steve               2
client3     Nicole Mitch               3
client4   Francis Morris               4

In [44]:
# 컬럼 인덱스 조회
bank_client_df.iloc[:, [0,1]]

         Bank client ID Bank Client Name
client1               1        Laila Aly
client2               2       Kate Steve
client3               3     Nicole Mitch
client4               4   Francis Morris

In [45]:
# filter 메소드 - items 컬럼명 조회
bank_client_df.filter(items=['Bank client ID', 'Net worth [$]'])

         Bank client ID  Net worth [$]
client1               1          35000
client2               2           3000
client3               3         100000
client4               4           2000

In [46]:
# filter - like 검색어 포함된 라벨 조회
bank_client_df.filter(like='$', axis=1) # 컬럼명 중에 $가 포함된 컬럼 조회

         Net worth [$]
client1          35000
client2           3000
client3         100000
client4           2000

In [48]:
# 행 인덱스 라벨중에 3이 포함된 행 조회
bank_client_df.filter(like='3', axis=0)

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client3               3     Nicole Mitch         100000               10

In [51]:
# 값 조회
# 아이디가 3인 고객 조회
print(bank_client_df['Bank client ID'] == 3) # boolean array
bank_client_df[bank_client_df['Bank client ID'] == 3]

client1    False
client2    False
client3     True
client4    False
Name: Bank client ID, dtype: bool

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client3               3     Nicole Mitch         100000               10

In [54]:
# 예치금액(Net worth)이 5000달러가 넘는 고객 조회
bank_client_df[bank_client_df['Net worth [$]'] > 5000]

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client1               1        Laila Aly          35000                4
client3               3     Nicole Mitch         100000               10

In [59]:
# 거래기간이 5년 이상인 고객 조회(고객의 이름만 조회)
bank_client_df[bank_client_df['Years with bank'] >= 5]['Bank Client Name']

client2        Kate Steve
client3      Nicole Mitch
client4    Francis Morris
Name: Bank Client Name, dtype: object

In [63]:
# 이름이 K로 시작하는 고객 조회
print(bank_client_df['Bank Client Name'].str)

starts_with_K = bank_client_df['Bank Client Name'].str.startswith('K')
bank_client_df[starts_with_K]

<pandas.core.strings.accessor.StringMethods object at 0x0000022D69867A70>

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client2               2       Kate Steve           3000                7

In [68]:
# 거래기간이 5년 이상이면서 이름이 o로 시작하는 고객 조회
# and(&), or(|), not(~)
_5_years_with_bank = bank_client_df['Years with bank'] >= 5
contains_o = bank_client_df['Bank Client Name'].str.contains('o')

print(bank_client_df[_5_years_with_bank & contains_o])

         Bank client ID Bank Client Name  Net worth [$]  Years with bank
client3               3     Nicole Mitch         100000               10
client4               4   Francis Morris           2000               15

## 행 추가/삭제

In [5]:
students = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]

df = pd.DataFrame(students, columns=['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [6]:
# 1. loc를 이용해 행추가
# 요소의 현재개수를 index로 지정하면 자동으로 마지막 인덱스 +1 처리가 될 것이다.
df.loc[len(df)] = ['David', 88, 75]
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3  David       88     75

In [16]:
# 2. pd.concat(dfs...) DataFrame 병합
another_student_df = pd.DataFrame([['Ben', 65, 99]], columns=['name', 'midterm', 'final'])

pd.concat([df, another_student_df], ignore_index=True) #ignore_index 인덱스를 새로부여

   name   age   job     salary type  midterm  final
0   홍길동  33.0   개발자  5000000.0   청년      NaN    NaN
1  신사임당  48.0    쉐프  5000000.0   청년      NaN    NaN
2   이순신  55.0  건설업자  5000000.0   중년      NaN    NaN
3   Ben   NaN   NaN        NaN  NaN     65.0   99.0

In [9]:
# 행 삭제
# index로 삭제
# df.drop(df.index[[4, 5]], inplace=True)
df = df.drop(df.index[[4, 5]])

IndexError: index 4 is out of bounds for axis 0 with size 4

In [17]:
df

   name  age   job   salary type
0   홍길동   33   개발자  5000000   청년
1  신사임당   48    쉐프  5000000   청년
2   이순신   55  건설업자  5000000   중년

## 컬럼 추가

In [18]:
df = pd.DataFrame({
    "name": ['홍길동', '신사임당', '이순신'],
    "age": [33, 48, 55],
    "job": ['개발자', '쉐프', '건설업자']
})
df

   name  age   job
0   홍길동   33   개발자
1  신사임당   48    쉐프
2   이순신   55  건설업자

In [19]:
# scala value로 컬럼 생성하기
df['salary'] = 5_000_000 # bracket notation
# df.salary = 5_000_000 # dot notation으로 컬럼 생성
df

   name  age   job   salary
0   홍길동   33   개발자  5000000
1  신사임당   48    쉐프  5000000
2   이순신   55  건설업자  5000000

In [20]:
# np.where(조건식, true일때 값, false일때 값)
df['type'] = np.where(df['age'] < 50, '청년', '중년')
df

   name  age   job   salary type
0   홍길동   33   개발자  5000000   청년
1  신사임당   48    쉐프  5000000   청년
2   이순신   55  건설업자  5000000   중년

In [21]:
# 기존칼럼 연산
df['annual_salary'] = df['salary'] * 12
df

   name  age   job   salary type  annual_salary
0   홍길동   33   개발자  5000000   청년       60000000
1  신사임당   48    쉐프  5000000   청년       60000000
2   이순신   55  건설업자  5000000   중년       60000000

In [22]:
# list 추가
df['birthday'] = ['1988-08-08','1999-09-09','2000-01-01']
df

   name  age   job   salary type  annual_salary    birthday
0   홍길동   33   개발자  5000000   청년       60000000  1988-08-08
1  신사임당   48    쉐프  5000000   청년       60000000  1999-09-09
2   이순신   55  건설업자  5000000   중년       60000000  2000-01-01

In [24]:
# 함수 반환값 추가하기
def get_type(value) :
    return '청년' if value < 50 else '중년'

# apply 함수를 호출. 이때 콜백함수 get_type을 전달
df['type2'] = df['age'].apply(get_type)
df

   name  age   job   salary type  annual_salary    birthday type2
0   홍길동   33   개발자  5000000   청년       60000000  1988-08-08    청년
1  신사임당   48    쉐프  5000000   청년       60000000  1999-09-09    청년
2   이순신   55  건설업자  5000000   중년       60000000  2000-01-01    중년

In [26]:
# birth_year 컬럼을 추가 : birthday에서 년도 4자리만 추출
def extract_year(value) :
    return int(value.split('-')[0])

df['birth_year'] = df.birthday.apply(extract_year) # dot notation(공백 및 특수 문자 있을 시 에러가 있어 아래 방식 사용 추천)
df

#df['birthyear'] = df['birthday'].apply(extract_year) # bracket notation

   name  age   job   salary type  annual_salary    birthday type2  birth_year
0   홍길동   33   개발자  5000000   청년       60000000  1988-08-08    청년        1988
1  신사임당   48    쉐프  5000000   청년       60000000  1999-09-09    청년        1999
2   이순신   55  건설업자  5000000   중년       60000000  2000-01-01    중년        2000

In [31]:
# 컬럼 삭제 birthyear 삭제!
df.drop('birth_year', axis=1, inplace=True)
df

   name  age   job   salary type  annual_salary    birthday type2
0   홍길동   33   개발자  5000000   청년       60000000  1988-08-08    청년
1  신사임당   48    쉐프  5000000   청년       60000000  1999-09-09    청년
2   이순신   55  건설업자  5000000   중년       60000000  2000-01-01    중년

In [32]:
## 정렬하기
df = pd.read_csv('data/bank_client_information.csv')
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [34]:
 df.sort_values('Net Worth', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [35]:
df #방금 진행한 sort를 반영이 안됨. inplace = true가 필요

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [36]:
df.sort_values('Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [37]:
# 정렬 기준으로 n개의 컬럼을 사용 가능. ascending 속성 역시 짝맞추어 n개를 작성
df.sort_values(['Net Worth', 'Years with Bank'], ascending = [False, False]) # 여러 개 칼럼을 사용 위해서는 대괄호

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [40]:
# 순위 부여하기
# 예치금액 내림차순 순위 부여하기
df.sort_values('Net Worth', ascending=False)
df['Rank'] = df['Net Worth'].rank(ascending=False).astype(int)
df.sort_values('Rank')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,rank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7,7
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8,8
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10,10